## Tutorial 9 - Python Pandas tutorial Part1 :

### we are going to learn about :
#### 1. Pandas Dataframe
#### 2. Pandas Series
#### 3. Pandas Basic Operations

In [11]:
import pandas as pd
import numpy as np

In [17]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [21]:
## Create Dataframe 
df = pd.DataFrame(data = np.arange(0,20).reshape(5,4),index = ["Row1","Row2","Row3","Row4","Row5"],columns= ["Column1","Column2","Column3","Column4"] )

In [23]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [25]:
df.tail()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [29]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [33]:
df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [37]:
 ## Indexing
## columnname, rowindex[loc], rowindex columnindex number[.iloc]
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [53]:
## By using columnname:
## type of this df will be dataframe, multiple rows/columns
df[['Column1','Column2','Column3']]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row5       16       17       18

In [47]:
##type of this df is series, single column/row
df['Column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [55]:
df.loc['Row3']

Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int32

In [59]:
## By using rowindex name
df.loc[['Row3','Row4']]

      Column1  Column2  Column3  Column4
Row3        8        9       10       11
Row4       12       13       14       15

In [61]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [63]:
df.iloc[2:4,0:2]

      Column1  Column2
Row3        8        9
Row4       12       13

In [65]:
df.iloc[2:,1:]

      Column2  Column3  Column4
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [77]:
## converting dataframe to array:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [81]:
## Basic operations
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [83]:

df = pd.DataFrame(data = [[1,np.nan,2],[1,3,4]],index = ["Row1","Row2"],columns= ["Column1","Column2","Column3"] )

In [85]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [95]:
df.isnull()

      Column1  Column2  Column3
Row1    False     True    False
Row2    False    False    False

In [97]:
df.isnull().sum==0

False

In [99]:
 df['Column3'].value_counts()

Column3
2    1
4    1
Name: count, dtype: int64

In [1]:
df['Column2'].unique()

NameError: name 'df' is not defined

In [105]:
df['Column2'].unique()

array([nan,  3.])

In [109]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4